Revit 2024 API
BendingDetailCustomFieldProperties.AngularDimensionTypeId Property
 Identifies the Id of the angular dimension type which is used to show dimensions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ElementId AngularDimensionTypeId { get; set; }
Visual Basic
Public Property AngularDimensionTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ AngularDimensionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The angularDimensionTypeId should be an id of an angular dimension type.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace